// *++
//
// Copyright (c) 2007-2025, Intel Corporation. All rights reserved.
// This program and the accompanying materials are licensed
// and made available under the terms and conditions of the BSD License which
// accompanies this distribution.  The full text of the license may be found at:
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// --*/


/=#

#langdef  en-US      "English (United States)" // English (United States)
#langdef  de-DE      "Deutsch (Deutschland)" // German (Germany)
#langdef  es-ES      "español (España)" // Spanish (Spain)
#langdef  fr-FR      "français (France)" // French (France)
#langdef  ja-JP      "日本語 (日本)" // Japanese (Japan)
#langdef  zh-Hans    "中文(简体)" // Chinese (Simplified)


#string STR_INV_FORM_SET_TITLE      #language en-US         "Intel PRO/1000 Network Connection"
                                    #language de-DE         "Intel PRO/1000 Netzwerkverbindung"
                                    #language es-ES         "Conexión de red de Intel PRO/1000"
                                    #language fr-FR         "Connexion réseau Intel PRO/1000"
                                    #language ja-JP         "インテル PRO/1000 ネットワーク・コネクション"
                                    #language zh-Hans       "Intel PRO/1000 网络连接"

#string STR_INV_FORM_SET_HELP       #language en-US         ""
                                    #language de-DE         ""
                                    #language es-ES         ""
                                    #language fr-FR         ""
                                    #language ja-JP         ""
                                    #language zh-Hans       ""

#string STR_INV_FORM_SET_1_HELP     #language en-US         "Configure Gigabit Ethernet device parameters."
                                    #language de-DE         "Parameter für Gigabit-Ethernet-Gerät konfigurieren."
                                    #language es-ES         "Configure los parámetros del dispositivo Ethernet Gigabit."
                                    #language fr-FR         "Configurez les paramètres du périphérique Gigabit Ethernet."
                                    #language ja-JP         "ギガビット・イーサネット・デバイスのパラメーターを設定します。"
                                    #language zh-Hans       "配置千兆位以太网设备参数。"

#string STR_INV_FORM_SET_2_5_HELP   #language en-US         "Configure 2.5 Gigabit Ethernet device parameters."
                                    #language de-DE         "Parameter für 2,5-Gigabit-Ethernet-Gerät konfigurieren."
                                    #language es-ES         "Configure los parámetros del dispositivo Gigabit Ethernet 2.5."
                                    #language fr-FR         "Configurez les paramètres du périphérique 2,5 Gigabit Ethernet."
                                    #language ja-JP         "2.5 ギガビット・イーサネット・デバイスのパラメーターを設定します。"
                                    #language zh-Hans       "配置 2.5 千兆位以太网设备参数。"

#string STR_INV_FORM_SET_5_HELP     #language en-US         "Configure 5 Gigabit Ethernet device parameters."
                                    #language de-DE         "Konfigurieren Sie die Parameter für 5-Gigabit-Ethernet-Komponenten."
                                    #language es-ES         "Configure los parámetros del dispositivo Ethernet de 5 Gigabits."
                                    #language fr-FR         "Configurez les paramètres du périphérique 5 Gigabit Ethernet."
                                    #language ja-JP         "5 ギガビット・イーサネット・デバイスのパラメーターを設定します。"
                                    #language zh-Hans       "配置 5 千兆位以太网设备参数。"

#string STR_INV_FORM_SET_10_HELP    #language en-US         "Configure 10 Gigabit Ethernet device parameters."
                                    #language de-DE         "Parameter für 10-Gigabit-Ethernet-Gerät konfigurieren."
                                    #language es-ES         "Configure los parámetros del dispositivo Ethernet 10 Gigabit."
                                    #language fr-FR         "Configurez les paramètres du périphérique 10 Gigabit Ethernet."
                                    #language ja-JP         "10 ギガビット・イーサネット・デバイスのパラメーターを設定します。"
                                    #language zh-Hans       "配置 10 千兆位以太网设备参数。"

#string STR_INV_FORM_SET_25_HELP    #language en-US         "Configure 25 Gigabit Ethernet device parameters."
                                    #language de-DE         "Parameter für 25-Gigabit-Ethernet-Gerät konfigurieren."
                                    #language es-ES         "Configure los parámetros del dispositivo Ethernet 25 Gigabit."
                                    #language fr-FR         "Configurez les paramètres du périphérique 25 Gigabit Ethernet."
                                    #language ja-JP         "25 ギガビット・イーサネット・デバイスのパラメーターを設定します。"
                                    #language zh-Hans       "配置 25 千兆位以太网设备参数。"

#string STR_INV_FORM_SET_40_HELP    #language en-US         "Configure 40 Gigabit Ethernet device parameters."
                                    #language de-DE         "Parameter für 40-Gigabit-Ethernet-Gerät konfigurieren."
                                    #language es-ES         "Configure los parámetros del dispositivo Ethernet 40 Gigabit."
                                    #language fr-FR         "Configurez les paramètres du périphérique 40 Gigabit Ethernet."
                                    #language ja-JP         "40 ギガビット・イーサネット・デバイスのパラメーターを設定します。"
                                    #language zh-Hans       "配置 40 千兆位以太网设备参数。"

#string STR_INV_FORM_SET_50_HELP    #language en-US         "Configure 50 Gigabit Ethernet device parameters."
                                    #language de-DE         "Parameter für 50-Gigabit-Ethernet-Gerät konfigurieren."
                                    #language es-ES         "Configure los parámetros del dispositivo Gigabit Ethernet 50."
                                    #language fr-FR         "Configurez les paramètres du périphérique 50 Gigabit Ethernet."
                                    #language ja-JP         "50 ギガビット・イーサネット・デバイスのパラメーターを設定します。"
                                    #language zh-Hans       "配置 50 千兆位以太网设备参数。"

#string STR_INV_FORM_SET_100_HELP   #language en-US         "Configure 100 Gigabit Ethernet device parameters."
                                    #language de-DE         "Parameter für 100-Gigabit-Ethernet-Gerät konfigurieren."
                                    #language es-ES         "Configure los parámetros del dispositivo Ethernet 100 Gigabit."
                                    #language fr-FR         "Configurez les paramètres du périphérique 100 Gigabit Ethernet."
                                    #language ja-JP         "100 ギガビット・イーサネット・デバイスのパラメーターを設定します。"
                                    #language zh-Hans       "配置 100 千兆位以太网设备参数。"

#string STR_INV_FORM_SET_200_HELP   #language en-US         "Configure 200 Gigabit Ethernet device parameters."
                                    #language de-DE         "Parameter für 200-Gigabit-Ethernet-Gerät konfigurieren."
                                    #language es-ES         "Configure los parámetros del dispositivo Ethernet 200 Gigabit."
                                    #language fr-FR         "Configurez les paramètres du périphérique 200 Gigabit Ethernet."
                                    #language ja-JP         "200 ギガビット・イーサネット・デバイスのパラメーターを設定します。"
                                    #language zh-Hans       "配置 200 千兆位以太网设备参数。"

#string STR_INV_FORM_MAIN_TITLE     #language en-US         "Main Configuration Page"
                                    #language de-DE         "Hauptkonfigurationsseite"
                                    #language es-ES         "Página principal de la configuración"
                                    #language fr-FR         "Page de configuration principale"
                                    #language ja-JP         "メイン 設定ページ"
                                    #language zh-Hans       "主配置页面"

#string STR_MAC_ADDR_PROMPT         #language en-US         "MAC Address"
                                    #language de-DE         "MAC-Adresse"
                                    #language es-ES         "Dirección MAC"
                                    #language fr-FR         "Adresse MAC"
                                    #language ja-JP         "MAC アドレス"
                                    #language zh-Hans       "MAC 地址"

#string STR_MAC_ADDR_TEXT           #language en-US         ""
                                    #language de-DE         ""
                                    #language es-ES         ""
                                    #language fr-FR         ""
                                    #language ja-JP         ""
                                    #language zh-Hans       ""

#string STR_MAC_ADDR_HELP           #language en-US         "Factory default MAC address of Ethernet port."
                                    #language de-DE         "Werkseitige Standard-MAC-Adresse der Ethernet-Schnittstelle."
                                    #language es-ES         "Dirección MAC predeterminada de fábrica del puerto Ethernet."
                                    #language fr-FR         "Adresse MAC par défaut du fabricant du port Ethernet."
                                    #language ja-JP         "イーサネット・ポートの工場出荷時のデフォルト MAC アドレス。"
                                    #language zh-Hans       "出厂默认的以太网端口 MAC 地址。"

#string STR_ALT_MAC_ADDR_PROMPT     #language en-US         "Virtual MAC Address"
                                    #language de-DE         "Virtuelle MAC-Adresse"
                                    #language es-ES         "Dirección MAC virtual"
                                    #language fr-FR         "Adresse MAC virtuelle"
                                    #language ja-JP         "仮想 MAC アドレス"
                                    #language zh-Hans       "虚拟 MAC 地址"

#string STR_ALT_MAC_ADDR_TEXT       #language en-US         "%02x:%02x:%02x:%02x:%02x:%02x"
                                    #language de-DE         "%02x:%02x:%02x:%02x:%02x:%02x"
                                    #language es-ES         "%02x:%02x:%02x:%02x:%02x:%02x"
                                    #language fr-FR         "%02x:%02x:%02x:%02x:%02x:%02x"
                                    #language ja-JP         "%02x:%02x:%02x:%02x:%02x:%02x"
                                    #language zh-Hans       "%02x:%02x:%02x:%02x:%02x:%02x"

#string STR_ALT_MAC_ADDR_HELP       #language en-US         "Programmatically assignable MAC address for port."
                                    #language de-DE         "Programmseitig zuweisbare MAC-Adresse für den Port."
                                    #language es-ES         "Dirección MAC asignable programáticamente para el puerto."
                                    #language fr-FR         "Adresse MAC pour le port pouvant être affectée par programmation."
                                    #language ja-JP         "ポートに対してプログラムにより割り当て可能な MAC アドレス。"
                                    #language zh-Hans       "可通过编程方式分配的端口 MAC 地址。"

#string STR_PCI_BUS_DEV_FUNC_PROMPT #language en-US         "PCI Address"
                                    #language de-DE         "PCI-Adresse"
                                    #language es-ES         "Dirección PCI"
                                    #language fr-FR         "Adresse PCI"
                                    #language ja-JP         "PCI アドレス"
                                    #language zh-Hans       "PCI 地址"

#string STR_PCI_BUS_DEV_FUNC_TEXT   #language en-US         "        "
                                    #language de-DE         "        "
                                    #language es-ES         "        "
                                    #language fr-FR         "        "
                                    #language ja-JP         "        "
                                    #language zh-Hans       "        "

#string STR_PCI_BUS_DEV_FUNC_HELP   #language en-US         "PCI device location."
                                    #language de-DE         "PCI-Geräteort."
                                    #language es-ES         "Ubicación del dispositivo PCI."
                                    #language fr-FR         "Emplacement du périphérique PCI."
                                    #language ja-JP         "PCI デバイスの場所。"
                                    #language zh-Hans       "PCI 设备位置。"

#string STR_ADAPTER_PBA_PROMPT      #language en-US         "Adapter PBA"
                                    #language de-DE         "Adapter-PBA"
                                    #language es-ES         "PBA del adaptador"
                                    #language fr-FR         "Carte PBA"
                                    #language ja-JP         "アダプター PBA"
                                    #language zh-Hans       "适配器 PBA"

#string STR_ADAPTER_PBA_TEXT        #language en-US         "%s"
                                    #language de-DE         "%s"
                                    #language es-ES         "%s"
                                    #language fr-FR         "%s"
                                    #language ja-JP         "%s"
                                    #language zh-Hans       "%s"

#string STR_ADAPTER_PBA_HELP        #language en-US         "A Printed Board Assembly (PBA) number is a unique code used to identify a printed board assembly."
                                    #language de-DE         "Die PBA-Nummer (Printed Board Assembly) ist eine eindeutige Kennung zur Identifikation einer Platine."
                                    #language es-ES         "El número de placa de cicuito impreso (PBA - Printed Board Assembly) es un código único usado para identificarla."
                                    #language fr-FR         "Un numéro PBA (Printed Board Assembly - Circuit imprimé) est un code unique utilisé pour identifier un circuit imprimé."
                                    #language ja-JP         "プリント基板ユニット(PBA) 番号はプリント基板ユニットを識別するためのコード番号です。"
                                    #language zh-Hans       "印刷电路板（PBA）号是用来标识印刷电路板的唯一代码。"

#string STR_CONTROLER_ID_PROMPT     #language en-US         "Chip Type"
                                    #language de-DE         "Chiptyp"
                                    #language es-ES         "Tipo de chip"
                                    #language fr-FR         "Type de puce"
                                    #language ja-JP         "チップタイプ"
                                    #language zh-Hans       "芯片类型"

#string STR_CONTROLER_ID_TEXT       #language en-US         "Unknown Controller"
                                    #language de-DE         "Unbekannter Controller"
                                    #language es-ES         "Controlador desconocido"
                                    #language fr-FR         "Contrôleur inconnu"
                                    #language ja-JP         "不明なコントローラー"
                                    #language zh-Hans       "未知控制器"

#string STR_CONTROLER_ID_HELP       #language en-US         "Network controller part number."
                                    #language de-DE         "Netzwerk-Controller-Teilenummer."
                                    #language es-ES         "Número de pieza del controlador de red."
                                    #language fr-FR         "Numéro de pièce du contrôleur réseau."
                                    #language ja-JP         "ネットワーク・コントローラーのパーツ番号。"
                                    #language zh-Hans       "网络控制器部件号。"

#string STR_DEVICE_ID_PROMPT        #language en-US         "PCI Device ID"
                                    #language de-DE         "PCI-Geräte-ID"
                                    #language es-ES         "ID de dispositivo PCI"
                                    #language fr-FR         "ID de périphérique PCI"
                                    #language ja-JP         "PCI デバイス ID"
                                    #language zh-Hans       "PCI 设备 ID"

#string STR_DEVICE_ID_TEXT          #language en-US         ""
                                    #language de-DE         ""
                                    #language es-ES         ""
                                    #language fr-FR         ""
                                    #language ja-JP         ""
                                    #language zh-Hans       ""

#string STR_DEVICE_ID_HELP          #language en-US        "PCI Device ID of this device."
                                    #language de-DE        "PCI-Geräte-ID dieses Geräts."
                                    #language es-ES        "ID de dispositivo PCI de este dispositivo."
                                    #language fr-FR        "ID de périphérique PCI de ce périphérique."
                                    #language ja-JP        "このデバイスの PCI デバイス ID。"
                                    #language zh-Hans      "设备的 PCI 设备 ID。"

#string STR_EFI_DRIVER_VER_PROMPT   #language en-US         "UEFI Driver"
                                    #language de-DE         "UEFI-Treiber"
                                    #language es-ES         "Controlador UEFI"
                                    #language fr-FR         "Pilote UEFI"
                                    #language ja-JP         "UEFI ドライバー"
                                    #language zh-Hans       "UEFI 驱动程序"

#string STR_EFI_DRIVER_VER_TEXT     #language en-US         ""
                                    #language de-DE         ""
                                    #language es-ES         ""
                                    #language fr-FR         ""
                                    #language ja-JP         ""
                                    #language zh-Hans       ""

#string STR_EFI_DRIVER_VER_HELP     #language en-US         "UEFI driver name and version number."
                                    #language de-DE         "UEFI-Treibername und -Versionsnummer."
                                    #language es-ES         "Nombre y número de versión del controlador UEFI."
                                    #language fr-FR         "Nom du pilote UEFI et numéro de version."
                                    #language ja-JP         "UEFI ドライバー名とバージョン番号。"
                                    #language zh-Hans       "UEFI 驱动程序名称和版本号。"

#string STR_BLINK_LED_PROMPT        #language en-US         "Blink LEDs"
                                    #language de-DE         "LEDs aufleuchten lassen"
                                    #language es-ES         "LED parpadeantes"
                                    #language fr-FR         "Faire clignoter les DEL"
                                    #language ja-JP         "LED 点滅"
                                    #language zh-Hans       "闪烁指示灯"

#string STR_BLINK_LED_HLP           #language en-US         "Blink LEDs for a duration up to 15 seconds."
                                    #language de-DE         "LEDs für bis zu 15 Sekunden blinken lassen."
                                    #language es-ES         "Parpadeo de luces indicadoras por una duración de hasta 15 segundos."
                                    #language fr-FR         "Faire clignoter les DEL pour une durée de 15 secondes maximum."
                                    #language ja-JP         "最高 15 秒間まで LED を点滅。"
                                    #language zh-Hans       "闪烁 LED，持续最长 15 秒。"

#string STR_NIC_CONFIG_MENU_REF     #language en-US         "NIC Configuration"
                                    #language de-DE         "NIC-Konfiguration"
                                    #language es-ES         "Configuración de NIC"
                                    #language fr-FR         "Configuration de la carte d'interface réseau"
                                    #language ja-JP         "NIC 設定"
                                    #language zh-Hans       "网卡配置"

// Generic help string for STR_NIC_CONFIG_MENU_REF
#string STR_NIC_CONFIG_MENU_REF_HLP #language en-US         "Click to configure the network device port."
                                    #language de-DE         "Klicken Sie, um den Netzwerkgeräteanschluss zu konfigurieren."
                                    #language es-ES         "Haga clic para configurar el puerto del dispositivo de red."
                                    #language fr-FR         "Cliquez pour configurer le port du périphérique réseau."
                                    #language ja-JP         "クリックしてネットワーク・デバイス・ポートを設定します。"
                                    #language zh-Hans       "单击以配置网络设备端口。"

#string STR_NIC_CONFIG_MENU         #language en-US         "NIC Configuration"
                                    #language de-DE         "NIC-Konfiguration"
                                    #language es-ES         "Configuración de NIC"
                                    #language fr-FR         "Configuration de la carte d'interface réseau"
                                    #language ja-JP         "NIC 設定"
                                    #language zh-Hans       "网卡配置"


#string LINK_SPEED_METHOD_PROMPT    #language en-US         "Link Speed Method"
                                    #language de-DE         "Methode für Verbindungsgeschwindigkeit"
                                    #language es-ES         "Método de velocidad de enlace"
                                    #language fr-FR         "Méthode de vitesse de liaison"
                                    #language ja-JP         "リンク速度の方法"
                                    #language zh-Hans       "链路速度法"

#string LINK_SPEED_METHOD_HELP      #language en-US         "Select if a port's link parameters (Link Speed, Forward Error Correction) are set automatically or by the user."
                                    #language de-DE         "Wählen Sie aus, ob die Verbindungsparameter eines Ports (Verbindungsgeschwindigkeit, Vorwärtsfehlerkorrektur) automatisch oder vom Benutzer eingestellt werden."
                                    #language es-ES         "Seleccione si los parámetros de enlace de un puerto (velocidad de enlace o corrección de errores para reenvío) se establecen de forma automática o por el usuario."
                                    #language fr-FR         "Sélectionnez si les paramètres de liaison d'un port (Vitesse de liaison, Correction des erreurs de transfert) sont définis automatiquement ou par l'utilisateur."
                                    #language ja-JP         "ポートのリンク・パラメーター (リンク速度、前方誤り訂正) を自動設定またはユーザー設定にするか選択します。"
                                    #language zh-Hans       "选择端口的链路参数（链路速度、前向纠错）是自动设置还是由用户设置。"

#string STR_LINK_SPEED_PROMPT       #language en-US         "Link Speed"
                                    #language de-DE         "Verbindungsgeschwindigkeit"
                                    #language es-ES         "Velocidad del enlace"
                                    #language fr-FR         "Vitesse de liaison"
                                    #language ja-JP         "リンク速度"
                                    #language zh-Hans       "链接速度"

#string STR_LINK_SPEED_SUBTITLE     #language en-US         "Link Speed"
                                    #language de-DE         "Verbindungsgeschwindigkeit"
                                    #language es-ES         "Velocidad del enlace"
                                    #language fr-FR         "Vitesse de liaison"
                                    #language ja-JP         "リンク速度"
                                    #language zh-Hans       "链接速度"

#string STR_LINK_SPEED_HELP         #language en-US         "Specifies the port speed used for the selected boot protocol."
                                    #language de-DE         "Gibt die Anschlussgeschwindigkeit an, die für das gewählte Boot-Protokoll verwendet wird."
                                    #language es-ES         "Especifica la velocidad de puerto utilizada para el protocolo de arranque seleccionado."
                                    #language fr-FR         "Spécifie la vitesse de port utilisée pour le protocole d'amorçage sélectionné."
                                    #language ja-JP         "選択されたブートプロトコルに対してポート速度を指定します。"
                                    #language zh-Hans       "指定用于所选定的引导协议的端口速度。"

#string STR_AUTONEG_TEXT            #language en-US         "Auto Negotiated"
                                    #language de-DE         "Automatisch ausgehandelt"
                                    #language es-ES         "Negociado automáticamente"
                                    #language fr-FR         "Négocié automatiquement"
                                    #language ja-JP         "オート・ネゴシエーション"
                                    #language zh-Hans       "自动协商"

#string STR_10HALF_TEXT             #language en-US         "10 Mbps Half"
                                    #language de-DE         "10 Mbit/s Halbduplex"
                                    #language es-ES         "10 Mbps medio"
                                    #language fr-FR         "10 Mbit/s Half"
                                    #language ja-JP         "10 Mbps 半二重"
                                    #language zh-Hans       "10 Mbps 半双工"

#string STR_10FULL_TEXT             #language en-US         "10 Mbps Full"
                                    #language de-DE         "10 Mbit/s Vollduplex"
                                    #language es-ES         "10 Mbps completo"
                                    #language fr-FR         "10 Mbit/s Full"
                                    #language ja-JP         "10 Mbps 全二重"
                                    #language zh-Hans       "10 Mbps 全双工"

#string STR_100HALF_TEXT            #language en-US         "100 Mbps Half"
                                    #language de-DE         "100 Mbit/s Halbduplex"
                                    #language es-ES         "100 Mbps medio"
                                    #language fr-FR         "100 Mbit/s Half"
                                    #language ja-JP         "100 Mbps 半二重"
                                    #language zh-Hans       "100 Mbps 半双工"

#string STR_100FULL_TEXT            #language en-US         "100 Mbps Full"
                                    #language de-DE         "100 Mbit/s Vollduplex"
                                    #language es-ES         "100 Mbps completo"
                                    #language fr-FR         "100 Mbit/s Full"
                                    #language ja-JP         "100 Mbps 全二重"
                                    #language zh-Hans       "100 Mbps 全双工"

#string STR_1000FULL_TEXT           #language en-US         "1000 Mbps Full"
                                    #language de-DE         "1000 Mbit/s Vollduplex"
                                    #language es-ES         "1000 Mbps completo"
                                    #language fr-FR         "1 000 Mbit/s - Intégral"
                                    #language ja-JP         "1000 Mbps 全二重"
                                    #language zh-Hans       "1000 Mbps 全工"


#string STR_WOL_TEXT                #language en-US         "Wake On LAN"
                                    #language de-DE         "Wake On LAN-Optionen"
                                    #language es-ES         "Wake On LAN"
                                    #language fr-FR         "Wake On LAN"
                                    #language ja-JP         "Wake On LAN"
                                    #language zh-Hans       "LAN 唤醒"

#string STR_WOL_HELP                #language en-US         "Enables power on of the system via LAN. Note that configuring Wake on LAN in the operating system does not change the value of this setting, but does override the behavior of Wake on LAN in OS controlled power states."
                                    #language de-DE         "Ermöglicht das Einschalten des Systems über LAN. Wenn Sie Wake-On-LAN im Betriebssystem konfigurieren, wird dadurch nicht der Wert diese Einstellung geändert. Vielmehr wird das Verhalten von Wake-On-LAN in vom Betriebssystem kontrollierten Energiezuständen übersteuert."
                                    #language es-ES         "Habilita el encendido del sistema a través de la LAN. Tenga en cuenta que configurar Wake on LAN en el sistema operativo no cambia el valor de este ajuste, pero sí que altera el comportamiento de Wake on LAN en los estados de alimentación controlados por el sistema operativo."
                                    #language fr-FR         "Active l’alimentation du système via un réseau LAN. Remarque : la configuration de la fonctionnalité Wake on LAN sur le système d’exploitation ne change pas la valeur de ce paramètre, mais change le comportement Wake on LAN dans les états d’alimentation contrôlés par le SE."
                                    #language ja-JP         "LAN 経由でシステムの電源オンを有効にします。オペレーティング・システムで Wake on LAN を設定すると、この設定の値は変更されませんが、OS 制御の電力状態で Wake on LAN の動作がオーバーライドされます。"
                                    #language zh-Hans       "通过局域网启动系统电源。注意：在操作系统中配置局域网唤醒不会更改此设置的值，但是会覆盖操作系统控制的电源状态中局域网唤醒的行为。"

#string STR_LLDP_AGENT_TEXT         #language en-US         "LLDP Agent"
                                    #language de-DE         "LLDP-Agent"
                                    #language es-ES         "Agente LLDP"
                                    #language fr-FR         "Agent LLDP"
                                    #language ja-JP         "LLDP エージェント"
                                    #language zh-Hans       "LLDP 代理"

#string STR_LLDP_AGENT_HELP         #language en-US         "Persistently enables or disables firmware's LLDP Agent. Note that disabling firmware's LLDP Agent also disables DCB functionality. Disabling firmware Agent allows LLDP packets from the switch to pass unobstructed to the OS. Some OS layer LLDP agents and software defined network layer LLDP agents need these packets to function properly."
                                    #language de-DE         "Aktiviert bzw. deaktiviert den LLDP-Agent der Firmware dauerhaft. Bitte beachten Sie, dass mit Deaktivierung des LLDP-Agent der Firmware auch die DCB-Funktionalität deaktiviert wird. Wenn der Firmware-Agent deaktiviert ist, können LLDP-Pakete vom Switch ungehindert an das Betriebssystem weitergeleitet werden. Einige LLDP-Agents auf Ebene des Betriebssystems und LLDP-Agents auf Ebene des softwaredefinierten Netzwerks brauchen diese Pakete, um korrekt funktionieren zu können."
                                    #language es-ES         "Habilita o deshabilita el agente LLDP del firmware. Tenga en cuenta que el agente LLDP del firmware también deshabilita la funcionalidad de DCB. Deshabilitar el agente de firmware permite que los paquetes LLDP del conmutador pasen sin obstáculos al sistema operativo. Algunos agentes LLDP de la capa del sistema operativo y agentes LLDP de la capa de red definida por software necesitan estos paquetes para funcionar correctamente."
                                    #language fr-FR         "Active ou désactive de façon permanente l’agent LLDP du microprogramme. Remarque : la désactivation de l’agent LLDP du microprogramme désactive également la fonctionnalité DCB. La désactivation de l’agent du microprogramme permet aux paquets LLDP du commutateur de passer sans encombre vers le SE. Certains agents LLDP de la couche SE ou agents LLDP de la couche réseau définie par logiciel ont besoin de ces paquets pour fonctionner correctement."
                                    #language ja-JP         "ファームウェアの LLDP エージェントを永続的に有効または無効にします。ファームウェアの LLDP エージェントを無効にすると、DCB 機能も無効になることにご注意ください。ファームウェアのエージェントを無効にすると、スイッチから送られる LLDP パケットが妨げられずに OS に渡されます。いくつかの OS 層 LLDP エージェントおよびソフトウェア定義のネットワーク層 LLDP エージェントには、正しく機能するためにこれらのパケットが必要です。"
                                    #language zh-Hans       "持续启用或禁用固件的 LLDP 代理。注意：禁用固件的 LLDP 代理也会禁用 DCB 功能。禁用固件代理允许来自交换机的 LLDP 数据包不受阻碍地传递到操作系统。有些操作系统层 LLDP 代理和软件定义的网络层 LLDP 代理需要这些数据包方能正常工作。"

#string STR_AUTO_LINK_TEXT          #language en-US         "Automatic Link on Startup"
                                    #language de-DE         "Automatische Verbindung beim Starten"
                                    #language es-ES         "Enlace automático durante el inicio"
                                    #language fr-FR         "Liaison automatique au démarrage"
                                    #language ja-JP         "起動時の自動リンク"
                                    #language zh-Hans       "启动时的自动链路"

#string STR_AUTO_LINK_HELP          #language en-US         "Automatically enables link on NIC boot. Disabling this feature maintains the link down until the OS brings the link up. Remote Management functions will remain disabled until the link is turned on by the OS."
                                    #language de-DE         "Aktiviert die Verbindung beim Starten der NIC automatisch. Beim Deaktivieren dieser Funktion bleibt die Verbindung inaktiv, bis das Betriebssystem die Verbindung aktiviert. Die Fernverwaltungsfunktionen bleiben deaktiviert, bis die Verbindung vom Betriebssystem aktiviert wird."
                                    #language es-ES         "Habilita automáticamente el enlace en el boot de la NIC. Al deshabilitar esta función se mantiene el enlace deshabilitado hasta que el SO lo restablezca. Las funciones de Administración remota permanecerán deshabilitadas hasta que el SO active el enlace."
                                    #language fr-FR         "Active automatiquement la liaison au démarrage de la NIC. La désactivation de cette fonctionnalité maintient la liaison désactivée jusqu'à ce que le système d'exploitation la réactive. Les fonctions d'administration à distance resteront désactivées jusqu'à ce que la liaison soit activée par le système d'exploitation."
                                    #language ja-JP         "NIC の起動時にリンクを自動的に有効にします。この機能を無効にすると、リンクは、OS がリンクを有効にするまで切断された状態に維持されます。リモート管理機能は、OS によってリンクが有効にされるまで無効の状態で維持されます。"
                                    #language zh-Hans       "在 NIC 启动时自动启用链路。禁用此功能可使链路保持关闭状态，直到操作系统启动该链路为止。远程管理功能将保持禁用状态，直到操作系统打开该链路为止。"

#string STR_ENABLED_TEXT            #language en-US         "Enabled"
                                    #language de-DE         "Aktiviert"
                                    #language es-ES         "Habilitado"
                                    #language fr-FR         "Activé(e)"
                                    #language ja-JP         "有効"
                                    #language zh-Hans       "已启用"


#string STR_DISABLED_TEXT           #language en-US         "Disabled"
                                    #language de-DE         "Deaktiviert"
                                    #language es-ES         "Deshabilitado"
                                    #language fr-FR         "Désactivé(e)"
                                    #language ja-JP         "無効"
                                    #language zh-Hans       "已禁用"

#string STR_AUTO_TEXT               #language en-US         "Auto"
                                    #language de-DE         "Autom."
                                    #language es-ES         "Automático"
                                    #language fr-FR         "Auto"
                                    #language ja-JP         "自動"
                                    #language zh-Hans       "自动"

#string STR_MANUAL_TEXT             #language en-US         "Manual"
                                    #language de-DE         "Manuell"
                                    #language es-ES         "Manual"
                                    #language fr-FR         "Manuel"
                                    #language ja-JP         "手動"
                                    #language zh-Hans       "手动"

#string STR_NA_TEXT                 #language en-US         "N/A"
                                    #language de-DE         "nicht zutreffend"
                                    #language es-ES         "N/A"
                                    #language fr-FR         "s. o."
                                    #language ja-JP         "なし"
                                    #language zh-Hans       "不适用"

#string STR_LINK_STATUS_PROMPT      #language en-US         "Link Status"
                                    #language de-DE         "Verbindungsstatus"
                                    #language es-ES         "Estado del enlace"
                                    #language fr-FR         "État de la liaison"
                                    #language ja-JP         "リンクのステータス"
                                    #language zh-Hans       "链接状态"

#string STR_LINK_STATUS_HELP        #language en-US         "Link Status."
                                    #language de-DE         "Verbindungsstatus."
                                    #language es-ES         "Estado del enlace."
                                    #language fr-FR         "État de la liaison."
                                    #language ja-JP         "リンクのステータス。"
                                    #language zh-Hans       "链接状态。"

#string STR_LINK_STAT_DISCONNECTED  #language en-US         "Disconnected"
                                    #language de-DE         "Nicht angeschlossen"
                                    #language es-ES         "Desconectado"
                                    #language fr-FR         "Déconnecté"
                                    #language ja-JP         "接続されていません"
                                    #language zh-Hans       "已断开连接"

#string STR_LINK_STAT_CONNECTED     #language en-US         "Connected"
                                    #language de-DE         "Angeschlossen"
                                    #language es-ES         "Conectado"
                                    #language fr-FR         "Connecté"
                                    #language ja-JP         "接続されています"
                                    #language zh-Hans       "已连接"

#string STR_DEVICE_LEVEL_CONFIG_MENU_REF #language en-US    "Device Level Configuration"
                                    #language de-DE         "Konfiguration auf Geräteebene"
                                    #language es-ES         "Configuración de nivel de dispositivo"
                                    #language fr-FR         "Configuration au niveau périphérique"
                                    #language ja-JP         "デバイスレベル設定"
                                    #language zh-Hans       "设备层的配置"

#string STR_DEVICE_LEVEL_CONFIG_MENU_REF_HELP #language en-US "View and configure global device level parameters."
                                    #language de-DE         "Globale Parameter auf Geräteebene anzeigen und konfigurieren."
                                    #language es-ES         "Vea y configure los parámetros de nivel de dispositivo global."
                                    #language fr-FR         "Afficher et configurer les paramètres globaux au niveau périphérique."
                                    #language ja-JP         "グローバル・デバイス・レベル・パラメーターを表示して設定します。"
                                    #language zh-Hans       "查看和配置全球设备层参数。"

#string STR_DEVICE_LEVEL_CONFIG_MENU #language en-US        "Device Level Configuration"
                                    #language de-DE         "Konfiguration auf Geräteebene"
                                    #language es-ES         "Configuración de nivel de dispositivo"
                                    #language fr-FR         "Configuration au niveau périphérique"
                                    #language ja-JP         "デバイスレベル設定"
                                    #language zh-Hans       "设备层的配置"

#string STR_DEVICE_NAME_HELP        #language en-US         "Official product name of this device."
                                    #language de-DE         "Offizieller Produktname dieses Geräts."
                                    #language es-ES         "Nombre de producto oficial de este dispositivo."
                                    #language fr-FR         "Nom de produit officiel de ce périphérique."
                                    #language ja-JP         "このデバイスの正式な製品名。"
                                    #language zh-Hans       "此设备的正式产品名称。"

#string STR_DEVICE_NAME_PROMPT      #language en-US         "Device Name"
                                    #language de-DE         "Gerätename"
                                    #language es-ES         "Nombre del dispositivo"
                                    #language fr-FR         "Nom de périphérique"
                                    #language ja-JP         "デバイス名"
                                    #language zh-Hans       "设备名称"

#string STR_DEVICE_NAME_TEXT        #language en-US         "Intel Fortville device name"
                                    #language de-DE         "Gerätename: Intel Fortville"
                                    #language es-ES         "Nombre de dispositivo Intel Fortville"
                                    #language fr-FR         "Nom du périphérique Intel Fortville"
                                    #language ja-JP         "インテル Fortville デバイス名"
                                    #language zh-Hans       "英特尔 Fortville 设备名称"

#string STR_XCEIVER_HEALTH_MESSAGE  #language en-US         ""
                                    #language de-DE         ""
                                    #language es-ES         ""
                                    #language fr-FR         ""
                                    #language ja-JP         ""
                                    #language zh-Hans       ""

#string STR_CORRUPTED_HEALTH_MESSAGE  #language en-US         ""
                                      #language de-DE         ""
                                      #language es-ES         ""
                                      #language fr-FR         ""
                                      #language ja-JP         ""
                                      #language zh-Hans       ""

#string STR_PORT_CFG_UNSUPPORTED_MESSAGE  #language en-US         ""
                                          #language de-DE         ""
                                          #language es-ES         ""
                                          #language fr-FR         ""
                                          #language ja-JP         ""
                                          #language zh-Hans       ""

#string STR_TOPO_MEDIA_MESSAGE      #language en-US         ""
                                    #language de-DE         ""
                                    #language es-ES         ""
                                    #language fr-FR         ""
                                    #language ja-JP         ""
                                    #language zh-Hans       ""

#string STR_MODULE_PWR_UNSUPPORTED_MESSAGE  #language en-US         ""
                                            #language de-DE         ""
                                            #language es-ES         ""
                                            #language fr-FR         ""
                                            #language ja-JP         ""
                                            #language zh-Hans       ""

#string STR_MODULE_NVM_INCOMPATIBLE_MESSAGE #language en-US         ""
                                            #language de-DE         ""
                                            #language es-ES         ""
                                            #language fr-FR         ""
                                            #language ja-JP         ""
                                            #language zh-Hans       ""

#string STR_PHY_LOAD_FAILURE_MESSAGE        #language en-US         ""
                                            #language de-DE         ""
                                            #language es-ES         ""
                                            #language fr-FR         ""
                                            #language ja-JP         ""
                                            #language zh-Hans       ""

#string STR_FW_HEALTH_MESSAGE       #language en-US         ""
                                    #language de-DE         ""
                                    #language es-ES         ""
                                    #language fr-FR         ""
                                    #language ja-JP         ""
                                    #language zh-Hans       ""

#string STR_FW_ROLLBACK_MESSAGE     #language en-US         ""
                                    #language de-DE         ""
                                    #language es-ES         ""
                                    #language fr-FR         ""
                                    #language ja-JP         ""
                                    #language zh-Hans       ""

#string STR_INV_EMPTY_STRING        #language en-US         ""
                                    #language de-DE         ""
                                    #language es-ES         ""
                                    #language fr-FR         ""
                                    #language ja-JP         ""
                                    #language zh-Hans       ""

#string STR_PORT_OPTION_CONFIG_MENU_REF        #language en-US         "Port Option Configuration"
                                               #language de-DE         "Konfiguration der Port-Option"
                                               #language es-ES         "Configuración de la opción de puerto"
                                               #language fr-FR         "Configuration de l'option port"
                                               #language ja-JP         "ポートオプションの構成"
                                               #language zh-Hans       "端口选项配置"

#string STR_PORT_OPTION_TITLE                  #language en-US         "Port Option Configuration"
                                               #language de-DE         "Konfiguration der Port-Option"
                                               #language es-ES         "Configuración de la opción de puerto"
                                               #language fr-FR         "Configuration de l'option port"
                                               #language ja-JP         "ポートオプションの構成"
                                               #language zh-Hans       "端口选项配置"

#string STR_PORT_OPTION_ONEOF_HELP             #language en-US         "Configure the port option of the device. Option string is defined as follows:\nQxPxS - if speeds are the same on all quads and lanes\n \nP1xS1-P2xS2 - if each quad has a specific speed\n \nP11xS11+<...>+P1nxS1n-P21xS21+<...>+P2mxS2m\n \nWhere:\nQ - number of quads\nP - number of ports at speed (S)\nS - port speed\nn - port/speed combination for quad 0\nm - port/speed combination for quad 1"
                                               #language de-DE         "Konfigurieren Sie die Anschlussoption des Geräts. Der String ist wie folgt definiert:\nQxPxS – wenn die Geschwindigkeiten auf allen Quads und Lanes gleich ist.\nP1xS1-P2xS2 – wenn jeder Quad eine bestimmte Geschwindigkeit hat.\n \nP11xS11+<...>+P1nxS1n-P21xS21+<...>+P2mxS2m\n \nWobei:\nQ – Anzahl der Quads\nP – Anzahl der Ports mit Geschwindigkeit (S)\nS – Portgeschwindigkeit\nn – Kombination Port/Geschwindigkeit für Quad 0\nm – Kombination Port/Geschwindigkeit für Quad 1"
                                               #language es-ES         "Configure la opción de puerto del dispositivo. La cadena de la opción está definida en el siguiente modo:\nQxPxS - si las velocidades son las mismas en todos los cuadrantes y carriles\n \nP1xS1-P2xS2 - si cada cuadrante tiene una velocidad específica\n \nP11xS11+<...>+P1nxS1n, P21xS21+<...>+P2mxS2m\n \nDonde:\nQ - número de cuadrantes\nP: número de puertos a velocidad (S)\nS: velocidad de puerto\nn: combinación de puerto/velocidad para el cuadrante 0\nm: combinación de puerto/velocidad para el cuadrante 1"
                                               #language fr-FR         "Configurez l'option port du périphérique. La chaîne d'option est définie comme suit :\nQxPxS - si les vitesses sont les mêmes sur tous les quads et toutes les voies \n \nP1xS1-P2xS2 - si chaque quad a une vitesse spécifique\n \nP11xS11+<...>+P1nxS1nxS1n-P21xS21+<...>+P2mxS2m\n \nOù :\nQ - nombre de quads\nP - nombre de ports à la vitesse (S)\nS - vitesse du port\nn - combinaison port/vitesse pour le quad 0\nm - combinaison port/vitesse pour le quad 1"
                                               #language ja-JP         "デバイスのポートのオプションを構成します。オプションの文字列は以下のように定義されています。\nQxPxS - すべてのクアッドとレーンで速度が同じである場合\n \nP1xS1-P2xS2 - 各クアッドの速度が一定である場合\n \nP11xS11+<...>+P1nxS1n-P21xS21+<...>+P2mxS2m\n \nここで、\nQ - クアッド数\nP - 速度 (S) におけるポート数\nS - ポート速度\nn - quad 0 のポート / 速度の組み合わせ\nm - quad 1 のポート / 速度の組み合わせ"
                                               #language zh-Hans       "配置设备的端口选项。选项字符串定义如下：\nQxPxS - 如果所有四通道上的速度都相同\n \nP1xS1-P2xS2 - 如果每个四通道具有特定速度\n \nP11xS11+<...>+P1nxS1n-P21xS21+<...>+P2mxS2m\n \n此处：\nQ - 四通道的数量\nP - 高速端口数\nS - 端口速度\nn - 四通道 0 的端口/速度组合\nm - 四通道 1 的端口/速度组合"

#string STR_PORT_OPTION_ONEOF_PROMPT           #language en-US         "Port Option"
                                               #language de-DE         "Port-Option"
                                               #language es-ES         "Opción de puerto"
                                               #language fr-FR         "Option port"
                                               #language ja-JP         "ポートオプション"
                                               #language zh-Hans       "端口选项"

#string STR_PORT_OPTION_SEPARATOR              #language en-US         "Port option outlines"
                                               #language de-DE         "Beschreibungen der Port-Optionen"
                                               #language es-ES         "Fundamentos de la opción de puerto"
                                               #language fr-FR         "Vue d'ensemble de l'option port"
                                               #language ja-JP         "ポートオプションの概要"
                                               #language zh-Hans       "端口选项概述"

#string STR_PORT_OPTION_PENDING1               #language en-US         "WARNING! Port option change is pending."
                                               #language de-DE         "WARNUNG! Die Änderung einer Port-Option ist ausstehend."
                                               #language es-ES         "¡AVISO! El cambio de la opción de puerto está pendiente."
                                               #language fr-FR         "AVERTISSEMENT ! Modification de l'option port en cours."
                                               #language ja-JP         "警告 ポートオプションの変更が保留中です。"
                                               #language zh-Hans       "警告！端口选项更改待处理。"

#string STR_PORT_OPTION_PENDING2               #language en-US         "Any changes to parameters other than 'Port Option'"
                                               #language de-DE         "Sämtliche Änderung der Parameter, außer „Port-Option“,"
                                               #language es-ES         "Cualquier cambio de parámetros más allá de \"opción de puerto\""
                                               #language fr-FR         "Toute modification de paramètres autres que « Option port »"
                                               #language ja-JP         "「ポートオプション」以外のパラメーターへの変更は、"
                                               #language zh-Hans       "在重新启动之前，将拒绝对“端口选项”以外的参数"

#string STR_PORT_OPTION_PENDING3               #language en-US         "will be rejected until reboot."
                                               #language de-DE         "werden bis zum Neustart abgelehnt."
                                               #language es-ES         "se rechazará hasta haber reiniciado."
                                               #language fr-FR         "sera rejetée jusqu'au redémarrage."
                                               #language ja-JP         "再起動するまで拒否されます。"
                                               #language zh-Hans       "做任何更改。"

#string STR_PORT_NVM_UPDATE_PENDING            #language en-US         "WARNING! NVM update is pending. Port Option change is not allowed until platform reboots."
                                               #language de-DE         "WARNUNG! NVM-Aktualisierung ist ausstehend. Eine Änderung der Port-Option ist nicht zulässig, bevor ein Neustart der Plattform erfolgt."
                                               #language es-ES         "¡AVISO! La actualización de NVM está pendiente. El cambio de la opción de puerto no está permitido hasta que se reinicie la plataforma."
                                               #language fr-FR         "AVERTISSEMENT ! La mise à jour de NVM est en cours. La modification de l'option port n'est pas autorisée avant le redémarrage de la plateforme."
                                               #language ja-JP         "警告 NVM のアップデートが保留中です。プラットフォームが再起動するまでポートオプションの変更はできません。"
                                               #language zh-Hans       "警告！NVM 更新待处理。在平台重新启动之前，不允许更改端口选项。"

#string STR_TX_BALANCING_PROMPT                #language en-US         "Transmit Balancing"
                                               #language de-DE         "Transmit Balancing"
                                               #language es-ES         "Equilibrio de transmisión"
                                               #language fr-FR         "Équilibrage de la transmission"
                                               #language ja-JP         "送信バランシング"
                                               #language zh-Hans       "传输平衡"

#string STR_TX_BALANCING_HELP                  #language en-US         "When enabled, this provides more consistent transmit fairness across queues, PFs, and VFs. Recommended in environments where highly scaled workloads are present and uneven performance is seen between threads."
                                               #language de-DE         "Wenn diese Option aktiviert ist, bietet dies eine konsistentere Übertragungsfairness über Warteschlangen, PFs und VFs hinweg. Empfohlen in Umgebungen, in denen stark skalierte Workloads vorhanden sind und zwischen den Threads eine ungleichmäßige Leistung auftritt."
                                               #language es-ES         "Cuando se habilita, esto proporciona una equidad de transmisión más consistente entre colas, PF y VF. Se recomienda en entornos donde hay cargas de trabajo de gran escala y se observa un desempeño desigual entre subprocesos."
                                               #language fr-FR         "Lorsque cette option est activée, elle assure une plus grande équité de transmission entre les files d’attente, les PF et les VF. Recommandé dans les environnements où des charges de travail très évolutives sont présentes et où les performances sont inégales entre les threads."
                                               #language ja-JP         "有効にすると、キュー、PF、および VF 間でより一貫した送信公平性が提供されます。 高度にスケーリングされたワークロードが存在し、スレッド間でパフォーマンスに不均衡が見られる環境で推奨されます。"
                                               #language zh-Hans       "启用后，此功能可在队列、PF 和 VF 之间提供更一致的传输公平性。建议用于存在高度扩展的工作负载，并且在线程之间看到性能不均衡的环境。"
